<?php
    namespace App\Http\Controllers\Utils;

    class Bank
    {
        static public $banks = [
            '001' => '한국은행',
            '002' => '산업은행',
            '003' => '기업은행',
            '004' => '국민은행',
            '005' => '외환은행',
            '007' => '수협은행',
            '008' => '수출입은행',
            '011' => '농협은행',
            '012' => '농협회원조합',
            '020' => '우리은행',
            '023' => 'SC제일은행',
            '026' => '서울은행',
            '027' => '한국씨티은행',
            '031' => '대구은행',
            '032' => '부산은행',
            '034' => '광주은행',
            '035' => '제주은행',
            '037' => '전북은행',
            '039' => '경남은행',
            '045' => '새마을금고연합회',
            '048' => '신협중앙회',
            '050' => '상호저축은행',
            '051' => '기타 외국계은행',
            '052' => '모건스탠리은행',
            '054' => 'HSBC은행',
            '055' => '도이치은행',
            '056' => '알비에스피엘씨은행',
            '057' => '제이피모간체이스은행',
            '058' => '미즈호코퍼레이트은행',
            '059' => '미쓰비시도쿄UFJ은행',
            '060' => 'BOA',
            '061' => '비엔피파리바은행',
            '062' => '중국공상은행',
            '063' => '중국은행',
            '064' => '산림조합',
            '065' => '대화은행',
            '071' => '우체국',
            '076' => '신용보증기금',
            '077' => '기술신용보증기금',
            '081' => '하나은행',
            '088' => '신한은행',
            '089' => '케이뱅크',
            '090' => '카카오뱅크',
            '092' => '토스뱅크',
            '094' => '서울보증보험',
            '101' => '한국신용정보원',
            '103' => 'SBI저축은행',
            '105' => '웰컴저축은행'
        ];

        static public function getBankName($bank_code)
        {
            return isset(self::$banks[$bank_code]) ? self::$banks[$bank_code] : null;
        }
    }
